{
  "title": "صوت الحكايا المنسية",
  "image": "assets/images/forgotten_tales.jpg",
  "nodes": [
    {
      "storyTitle": "بين جبال الحبر السائل، لا وجود للنجوم. لا صوت للمطر ولا دفء للشمس. كل شيء حبر أسود، وصمت ثقيل. كان عالمنا، 'نهر الكلام'، يغرق في النسيان. أنا 'أرِق'، آخر من تبقى من الحكائين، أحاول أن أتذكر الحكاية التي يمكنها أن تعيد الألوان والقصص لعالمي. كل ليلة أبحث عن حكاية، وفي كل ليلة يزداد الصمت.",
      "choice1": "أبحث عن 'الوتر الأخير' في مكتبة العقل الأبدي.",
      "choice2": "أذهب إلى 'بئر الصدى' حيث تُحبس الحكايات القديمة.",
      "next1": 1,
      "next2": 2,
      "isEnding": false
    },
    {
      "storyTitle": "مكتبة العقل الأبدي، مكان مليء بالكتب الفارغة والأرفف التي كانت يوماً ما تحمل أثمن الحكايات. أجد كتابًا مكتوبًا بلغة قديمة لم أستطع فك شفرتها. وفجأة، يهتز الكتاب، وتخرج منه كلمة واحدة بلون أحمر قاني: 'تضحية'.",
      "choice1": "ألمس الكلمة الحمراء وأضحي بجزء من ذكرياتي لفك شفرة الكتاب.",
      "choice2": "أتجاهل الكلمة وأبحث عن دليل آخر.",
      "next1": 3,
      "next2": 4,
      "isEnding": false
    },
    {
      "storyTitle": "بئر الصدى، عمقها بلا نهاية، وكلما رميت فيها حكاية قديمة، ردت عليّ بصمت. وفجأة، أرى في قاع البئر وميضًا خافتًا. إنه ليس ضوءًا، بل همسة. همسة حكاية ترفض أن تموت. إنها تقول: 'لتجد الحكاية المفقودة، عليك أن تخيطها'.",
      "choice1": "أنزل إلى البئر لأتبع الهمسة.",
      "choice2": "أعود إلى قريتي وأبحث عن خيط وإبرة.",
      "next1": 5,
      "next2": 6,
      "isEnding": false
    },
    {
      "storyTitle": "عندما ضحيت بجزء من ذكرياتي، فككت شفرة الكتاب. إنه يروي قصة 'صانع القصص' الذي نسي نفسه. وأنقاذ العالم يتطلب إيقاظه. الطريق إليه يمر عبر 'غابة الأحرف المفقودة'.",
      "choice1": "أغامر في غابة الأحرف المفقودة.",
      "choice2": "أحاول أن أجد طريقة أخرى لتذكر الحكاية.",
      "next1": 7,
      "next2": 6,
      "isEnding": false
    },
    {
      "storyTitle": "تجولك في المكتبة لا يؤدي إلى شيء، الصمت يتزايد. فجأة، ينهار أحد الأرفف ويظهر خلفه ممر سري يضيء بكلمات عائمة. هذا الممر يوصلك إلى 'بئر الصدى'.",
      "choice1": "أدخل الممر وأذهب إلى البئر.",
      "choice2": "أهرب من المكتبة قبل أن ينهار كل شيء.",
      "next1": 2,
      "next2": 8,
      "isEnding": false
    },
    {
      "storyTitle": "في قاع البئر، تجد 'الوتر الأخير'، خيط رفيع من الضوء ينبض بالحياة. تكتشف أن صانع القصص قد سرق خيوط الحكايات لكي لا ينسى قصته، وحجزها داخل 'بئر الصدى'.",
      "choice1": "أستخدم 'الوتر الأخير' لأعيد حياكة الحكايات.",
      "choice2": "أتجاهل الوتر وأبحث عن صانع القصص نفسه.",
      "next1": 9,
      "next2": 10,
      "isEnding": false
    },
    {
      "storyTitle": "تجد في قريتك إبرة وخيطًا، لكنها عادية، ليست ذهبية. تبدأ في حياكة القصص بنفسك مستخدماً خيالك وذكرياتك. تكتشف أن الحكايات ليست شيئًا يُوجد، بل شيئًا يُخلق. كل غرزة تحيكها تعيد لوناً واحداً للعالم. لكن خيالك بدأ ينضب.",
      "choice1": "أكمل الحياكة حتى لو نفد خيالي.",
      "choice2": "أرجع إلى المكتبة وأبحث عن المزيد من الكلمات.",
      "next1": 11,
      "next2": 1,
      "isEnding": false
    },
    {
      "storyTitle": "في 'غابة الأحرف المفقودة'، كل خطوة تُنسي جزءًا من اسمك. تكتشف أن صانع القصص يعيش في برج من الذكريات المفقودة، ويحاول أن ينسج 'حكاية أبدية' حتى لا ينسى. هو ليس شريراً، بل خائف.",
      "choice1": "أواجهه وأقنعه بالتخلي عن برجه.",
      "choice2": "أتسلل إلى البرج وأعيد الذكريات المفقودة.",
      "next1": 12,
      "next2": 13,
      "isEnding": false
    },
    {
      "storyTitle": "هروبك من المكتبة يؤدي إلى طريق مسدود، تتضاءل الألوان تدريجياً حتى يصبح عالمك مجرد ورقة بيضاء. لم يعد هناك شيء، ولا حتى أنت. فقدت نفسك في العدم.",
      "isEnding": true
    },
    {
      "storyTitle": "عندما تستخدم 'الوتر الأخير' لتعيد الحكايات، تكتشف أن كل خيط هو قصة شخص. تعيد الألوان للعالم، لكن كل حكاية تعيدها، تُنسي جزءًا من حكاية صانع القصص نفسه، إلى أن يختفي تمامًا. العالم عاد، لكن على حساب حكايته الوحيدة.",
      "isEnding": true
    },
    {
      "storyTitle": "تصل إلى صانع القصص، رجل عجوز وحيد، ينسج حكايته الأخيرة. يخبرك أن العالم ينسى القصص لأن الناس لم يعد لديهم الوقت للاستماع. يعطيك خيطًا ويقول: 'الحكاية ليست في الكلمات، بل في القلب'.",
      "choice1": "أواجه الشيخ وأقاتله.",
      "choice2": "أفهم ما قاله وأحيك أول قصة من قلبي.",
      "next1": 14,
      "next2": 15,
      "isEnding": false
    },
    {
      "storyTitle": "حتى مع نفاد خيالك، تستمر في الحياكة. فجأة، تجد أن الغرز التي تحيكها ليست مجرد ألوان، بل هي ذكرياتك. أنت تستخدم حكاياتك الشخصية لإعادة الحياة للعالم. العالم يعود للحياة، لكنه يصبح نسخة منك. كل شيء يرى من خلال عينيك ويسمع من خلال أذنيك.",
      "isEnding": true
    },
    {
      "storyTitle": "تقنع صانع القصص بأن نسيان القصص ليس نهاية العالم، بل بداية لقصص جديدة. تمد له يدك، ويتخلى عن برجه. خيوط الحكايات تعود إلى مكانها، والعالم يعود للحياة. أنت وصانع القصص تبدآن في حياكة قصص جديدة معًا، هذه المرة من أجل العالم بأسره.",
      "isEnding": true
    },
    {
      "storyTitle": "تسللت إلى البرج، ولكنك تجد نفسك في متاهة من الذكريات. تكتشف أن صانع القصص ليس رجلاً واحدًا، بل هو الوعي الجماعي لجميع الحكائين الذين عاشوا في الماضي. لإيقاظه، عليك أن تجد 'ذكرى الأمل الأولى'.",
      "choice1": "أبحث عن 'ذكرى الأمل الأولى' داخل المتاهة.",
      "choice2": "أخرج من المتاهة وأبحث عن حل آخر.",
      "next1": 16,
      "next2": 10,
      "isEnding": false
    },
    {
      "storyTitle": "في معركتك مع الشيخ، تدرك أنك تقاتل جزءاً من نفسك. تكتشف أنك أنت صانع القصص، وأن النسيان هو نتيجة خوفك من أن تكون حكايتك الأخيرة. تستعيد ذاكرتك، لكن العالم يصبح فارغاً، لأنك استنفدت كل طاقتك في هذه المعركة. العالم لا يزال بلا ألوان، لكنك على الأقل، لم تنسَ حكايتك.",
      "isEnding": true
    },
    {
      "storyTitle": "عندما تحيك أول قصة من قلبك، تتدفق الألوان إلى العالم. لا تكتشف فقط أنك أنت صانع القصص، بل أن كل شخص في العالم هو حكّاء، وأن المشكلة كانت فقط أنهم توقفوا عن حياكة قصصهم. تعود الألوان، ليس لأنك أنقذت العالم، بل لأنك ذكّرتهم بما هم عليه حقاً.",
      "isEnding": true
    },
    {
      "storyTitle": "تجد 'ذكرى الأمل الأولى' في قلب المتاهة. إنها قصة أول حكاية على الإطلاق، قصة عن 'الكلمة الأولى' التي أضاءت العالم. عندما تعيد هذه الذكرى إلى صانع القصص، يستيقظ. يدرك أن الحكاية ليست مجرد كلمات، بل هي قوة تتجدد. العالم يعود للحياة، والحكائون الجدد يكتبون قصصهم بحرية.",
      "isEnding": true
    }
  ]
}