{
  "title": "نسيج النور",
  "image": "assets/images/light.jpg",
  "nodes": [
    {
      "storyTitle": "لم أسمع صفير الريح أبدًا بين أغصان شجر الدردار، لكني دائمًا أستطيع رؤيته. الضوء يموت، الصمت يغزو القرية ويجردها من ألوانها.",
      "choice1": "التجرؤ على دخول الغابة المحرمة للبحث عن المصدر",
      "choice2": "الالتزام بتقاليد القرية والبقاء في المنزل",
      "next1": 1,
      "next2": 2,
      "isEnding": false
    },
    {
      "storyTitle": "داخل الغابة المظلمة، تكتشف لمى أن هناك كائنات روحية صغيرة تمثل المشاعر الإيجابية وتذبل الآن. الوحوش المصنوعة من الظلام تراقبها.",
      "choice1": "استخدام إبرة وخيط ذهبي لإنقاذ الكائنات",
      "choice2": "محاولة الهروب والعودة للقرية",
      "next1": 3,
      "next2": 2,
      "isEnding": false
    },
    {
      "storyTitle": "البقاء في المنزل لم يحل المشكلة، القرية تستمر بالذوبان في الصمت والرمادي. المشاعر تختفي تدريجيًا.",
      "choice1": "أعد التفكير وأدخل الغابة سرًا",
      "choice2": "استسلم للظلام ولا تحاول",
      "next1": 1,
      "next2": 8,
      "isEnding": false
    },
    {
      "storyTitle": "تبدأ لمى بحياكة أشرعة من نور باستخدام الخيط الذهبي، تحاول إعادة إشعال الضوء في الكائنات الروحية، وتواجه الوحوش المظلمة.",
      "choice1": "مواصلة حياكة الأشرعة ومواجهة الوحوش بشجاعة",
      "choice2": "التراجع مؤقتًا للتخطيط",
      "next1": 4,
      "next2": 5,
      "isEnding": false
    },
    {
      "storyTitle": "تكتشف الحقيقة الصادمة: الكائنات الروحية هي من يحافظ على توازن المشاعر في العالم. الخيط الذهبي جزء من منسج القدر الأسطوري، والشيخ الحكيم هو من سرقه.",
      "choice1": "مواجهة الشيخ وإعادة الخيط الأساسي",
      "choice2": "التسلل لإعادة الخيط سرًا دون مواجهته",
      "next1": 6,
      "next2": 6,
      "isEnding": false
    },
    {
      "storyTitle": "التخطيط ساعدها على معرفة نقاط ضعف الوحوش والشيخ، لكنها تحتاج لشجاعة إضافية لمواجهة السيطرة المباشرة.",
      "choice1": "الاندفاع لمواجهة الشيخ الآن",
      "choice2": "جمع المزيد من المعلومات عن المنسج وقوته",
      "next1": 6,
      "next2": 4,
      "isEnding": false
    },
    {
      "storyTitle": "في المعركة النهائية داخل قلعة الشيخ، تستخدم لمى خيطها الذهبي الأصغر لتفكيك نسيج الظلام، غرزة تلو الأخرى، مطلقة المشاعر الحبيسة في موجة من الضوء.",
      "choice1": "إكمال المعركة حتى النهاية",
      "choice2": "ترك المهمة لغيرها من الكائنات الروحية لمساعدة الأرض",
      "next1": 7,
      "next2": 7,
      "isEnding": false
    },
    {
      "storyTitle": "نجحت لمى في تحرير المشاعر واستعادة التوازن، القرية تعود تدريجيًا للألوان والحياة، ولم تعد المعركة بين نور وظلام فقط، بل بين قمع وحرية.",
      "isEnding": true
    },
    {
      "storyTitle": "استسلامها للظلام أدى لفقدان دائم للألوان والمشاعر، القرية تحولت إلى عالم باهت، والكائنات الروحية اختفت.",
      "isEnding": true
    }
  ]
}
